tests/GridField/GridFieldTestPayments.yml

Payment:
  payment1:
    Gateway: Manual
    MoneyAmount: 20.23
    MoneyCurrency: NZD
    Status: Authorized
    Created: 2013-10-10 12:00:00
    Identifier: 5039b3c8ffbdb50a2102bc172ebbf755
  payment2:
    Gateway: Manual
    MoneyAmount: 20.23
    MoneyCurrency: NZD
    Status: Captured
    Created: 2013-10-10 12:00:00
    Identifier: 9ca29d5d78833cdacaa0c70761a594d1
  payment3:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 1234.56
    MoneyCurrency: USD
    Status: Authorized
    Identifier: 8e08c54f25b8d3d247c477b8fa370020
  payment4:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 769.50
    MoneyCurrency: AUD
    Status: Captured
    Identifier: 1cdee90939ee11d68d23fd1601c26ea4
  payment5:
    Gateway: UknownGateway
    MoneyAmount: 2.50
    MoneyCurrency: NZD
    Status: Void
    Identifier: d71373c097e9858b96444eb4e05fec2b

